src/main/resources/sample_commands.txt

--- From created xml file
curl --header "content-type: text/xml" -d @soap_request.xml http://localhost:8080/ws


--Compact output
curl -fsSL --header "content-type: text/xml" -d @soap_request.xml http://localhost:8080/ws > output.xml and xmllint --format output.xml

--- From inline run
curl <<-EOF -fsSL -H "content-type: text/xml" -d @- http://localhost:8080/ws \
  > target/response.xml && xmllint --format target/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getCountryRequest>
         <gs:name>Spain</gs:name>
      </gs:getCountryRequest>
   </soapenv:Body>
</soapenv:Envelope>

EOF